In [1]:
import numpy as np
import pandas as pd

## Series

In [2]:
data = [1,2,3]
index = ['a','b','c']
s = pd.Series(data=data, index=index, name='sss')
s

a    1
b    2
c    3
Name: sss, dtype: int64

In [3]:
s.index

Index(['a', 'b', 'c'], dtype='object')

In [4]:
s.name

'sss'

### Mask

In [5]:
s = pd.Series(data=[1, 2, 3], index=['a', 'b', 'c'])
s

a    1
b    2
c    3
dtype: int64

In [6]:
mask = [False, True, False]
s[mask]

b    2
dtype: int64

In [7]:
s1 = s.copy()
s1['d'] = 4
s1

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
del s1['d']
s1

a    1
b    2
c    3
dtype: int64

## DataFrame

In [9]:
data = [[1,2,3],
        [4,5,6]]
index = ['a','b']
columns = ['A','B','C']
df = pd.DataFrame(data=data, index = index, columns = columns)
df

   A  B  C
a  1  2  3
b  4  5  6

In [10]:
df.index

Index(['a', 'b'], dtype='object')

In [11]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [12]:
df['A']

a    1
b    4
Name: A, dtype: int64

In [13]:
df[['A', 'C']]

   A  C
a  1  3
b  4  6

In [14]:
df1 = df.copy()
df1.loc['a', 'A'] = 10
df1

    A  B  C
a  10  2  3
b   4  5  6

In [15]:
df1.index = ['e', 'f']
df1.columns = ['E', 'F', 'G']
df1

    E  F  G
e  10  2  3
f   4  5  6

In [16]:
df1.rename(index={'e': 'b'}, columns={'E': 'A'}, inplace=True)
df1

    A  F  G
b  10  2  3
f   4  5  6

In [17]:
df1.drop(['b'], axis=0)

   A  F  G
f  4  5  6

In [18]:
# axis : {0 or ‘index’, 1 or ‘columns’}, default 0
df1.drop(['A', 'G'], axis=1)

   F
b  2
f  5

### Merge

In [19]:
df1 = pd.DataFrame([[1,2],
                    [3,4]], index=['a', 'b'], columns=['A', 'B'])
df1

   A  B
a  1  2
b  3  4

In [20]:
df2 = pd.DataFrame([[1,3],
                    [4,8]], index=['b', 'd'], columns=['B', 'C'])
df2

   B  C
b  1  3
d  4  8

In [21]:
pd.merge(left=df1, right=df2, how='inner', on=['B'])

   A  B  C
0  3  4  8

In [22]:
pd.merge(left=df1, right=df2, how='inner', left_on=['A'], right_on=['C'])

   A  B_x  B_y  C
0  3    4    1  3

In [23]:
pd.merge(left=df1, right=df2, how='left', on=['B'] )

   A  B    C
0  1  2  NaN
1  3  4  8.0

In [24]:
df = pd.DataFrame([[1,2],
                   [3,5]], index = ['a','b'], columns = ['A','B'])
df

   A  B
a  1  2
b  3  5

In [25]:
df.count(axis=0)

A    2
B    2
dtype: int64

In [26]:
df.count(axis=1)

a    2
b    2
dtype: int64

## Read from file

In [27]:
df = pd.read_csv('data/olympics.csv', sep=',', index_col=0, skiprows=1)
df.head()

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [28]:
for col in df.columns:
    if col[:2]=='01':
        df.rename(columns={col:'Gold'+col[4:]}, inplace=True)
    if col[:2]=='02':
        df.rename(columns={col:'Silver'+col[4:]}, inplace=True)
    if col[:2]=='03':
        df.rename(columns={col:'Bronze'+col[4:]}, inplace=True)
    if col[:1]=='№':
        df.rename(columns={col:'#'+col[1:]}, inplace=True)

names_ids = df.index.str.split('\s\(') # split the index by '('

df.index = names_ids.str[0] # the [0] element is the country name (new index) 
df['ID'] = names_ids.str[1].str[:3] # the [1] element is the abbreviation or ID (take first 3 characters from that)

df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,ID
Afghanistan,13,0,0,2,2,0,0,0,0,0,13,0,0,2,2,AFG
Algeria,12,5,2,8,15,3,0,0,0,0,15,5,2,8,15,ALG
Argentina,23,18,24,28,70,18,0,0,0,0,41,18,24,28,70,ARG
Armenia,5,1,2,9,12,6,0,0,0,0,11,1,2,9,12,ARM
Australasia,2,3,4,5,12,0,0,0,0,0,2,3,4,5,12,ANZ

In [29]:
df[(df.Gold >= 100) & (df.Silver > 100)].head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,ID
Australia,25,139,152,177,468,18,5,3,4,12,43,144,155,181,480,AUS
China,9,201,146,126,473,10,12,22,19,53,19,213,168,145,526,CHN
France,27,202,223,246,671,22,31,31,47,109,49,233,254,293,780,FRA
Germany,15,174,182,217,573,11,78,78,53,209,26,252,260,270,782,GER
East Germany,5,153,129,127,409,6,39,36,35,110,11,192,165,162,519,GDR

In [30]:
print('country wins the most gold: ' + df['Gold'].idxmax())

country wins the most gold: Totals

In [31]:
def biggest_diff_between_summer_winter_gold(df):
    df['country'] = df.index
    tmp = df.set_index(abs(df['Gold'] - df['Gold.1']))
    tmp = tmp.sort_index(ascending=False)
    
    return tmp.iloc[0]['country']

biggest_diff_between_summer_winter_gold(df)

'Totals'

In [32]:
def relative_max():
    df['country'] = df.index
    tmp = df.where((df['Gold'] > 0) & (df['Gold.1'] > 0)).dropna()
    tmp = tmp.set_index(abs(tmp['Gold'] - tmp['Gold.1']) / (tmp['Gold'] + tmp['Gold.1']))
    tmp = tmp.sort_index(ascending=False)

    return tmp.iloc[0]['country']

relative_max()

'Bulgaria'

In [33]:
def count_points():
    Points = pd.Series(df['Gold.2'] * 3 + df['Silver.2'] * 2 + df['Bronze.2'], df.index)
    print(len(Points))
    return Points

count_points().head()

147

Afghanistan      2
Algeria         27
Argentina      130
Armenia         16
Australasia     22
dtype: int64

### Overall Info

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 147 entries, Afghanistan to Totals
Data columns (total 17 columns):
# Summer          147 non-null int64
Gold              147 non-null int64
Silver            147 non-null int64
Bronze            147 non-null int64
Total             147 non-null int64
# Winter          147 non-null int64
Gold.1            147 non-null int64
Silver.1          147 non-null int64
Bronze.1          147 non-null int64
Total.1           147 non-null int64
# Games           147 non-null int64
Gold.2            147 non-null int64
Silver.2          147 non-null int64
Bronze.2          147 non-null int64
Combined total    147 non-null int64
ID                146 non-null object
country           147 non-null object
dtypes: int64(15), object(2)
memory usage: 20.7+ KB

In [35]:
df.ndim

2

In [36]:
df.shape

(147, 17)

In [37]:
df.size

2499

In [38]:
df.head(2)

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,ID,country
Afghanistan,13,0,0,2,2,0,0,0,0,0,13,0,0,2,2,AFG,Afghanistan
Algeria,12,5,2,8,15,3,0,0,0,0,15,5,2,8,15,ALG,Algeria

In [39]:
df.tail(2)

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,ID,country
Mixed team,3,8,5,4,17,0,0,0,0,0,3,8,5,4,17,ZZX,Mixed team
Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579,NaN,Totals

In [40]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Index: 147 entries, Afghanistan to Totals
Data columns (total 17 columns):
# Summer          147 non-null int64
Gold              147 non-null int64
Silver            147 non-null int64
Bronze            147 non-null int64
Total             147 non-null int64
# Winter          147 non-null int64
Gold.1            147 non-null int64
Silver.1          147 non-null int64
Bronze.1          147 non-null int64
Total.1           147 non-null int64
# Games           147 non-null int64
Gold.2            147 non-null int64
Silver.2          147 non-null int64
Bronze.2          147 non-null int64
Combined total    147 non-null int64
ID                146 non-null object
country           147 non-null object
dtypes: int64(15), object(2)
memory usage: 44.7 KB

In [41]:
df.describe()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
count,147.000000,147.000000,147.000000,147.000000,147.000000,147.000000,147.000000,147.000000,147.000000,147.000000,147.000000,147.000000,147.000000,147.000000,147.000000
mean,13.476190,65.428571,64.965986,69.795918,200.190476,6.700680,13.047619,13.034014,12.897959,38.979592,20.176871,78.476190,78.000000,82.693878,239.170068
std,7.072359,405.549990,399.309960,427.187344,1231.306297,7.433186,80.799204,80.634421,79.588388,240.917324,13.257048,485.013378,478.860334,505.855110,1469.067883
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,1.000000
25%,8.000000,0.000000,1.000000,1.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,11.000000,0.000000,1.000000,1.000000,2.500000
50%,13.000000,3.000000,4.000000,6.000000,12.000000,5.000000,0.000000,0.000000,0.000000,0.000000,15.000000,3.000000,4.000000,7.000000,12.000000
75%,18.500000,24.000000,28.000000,29.000000,86.000000,10.000000,1.000000,2.000000,1.000000,5.000000,27.000000,25.500000,29.000000,32.500000,89.000000
max,27.000000,4809.000000,4775.000000,5130.000000,14714.000000,22.000000,959.000000,958.000000,948.000000,2865.000000,49.000000,5768.000000,5733.000000,6078.000000,17579.000000